     A*******************************************************
     A* Compteur                                            *
     A*                                                     *
     A*******************************************************
     A                                      UNIQUE
     A          R FCPF                      PFILE(FCP00P)
     A                                      FORMAT(FCP00P)
     A          K CPCOD
