000100160929     A*******************************************************
000200160929     A* Compteur                                            *
000300160929     A*                                                     *
000400160929     A*******************************************************
000500160929     A                                      UNIQUE
000600160929     A          R FCPF                      PFILE(FCP00P)
000700160929     A                                      FORMAT(FCP00P)
000800160929     A          K CPCOD
