     A*******************************************************
     A* Fichier du personnel                                *
     A*                                                     *
     A*******************************************************
     A                                      UNIQUE
     A          R FICF                      PFILE(TBIBDTA/FIC00P)
     A                                      FORMAT(FIC00P)
     A          K FIMAT
