000100160929     A*******************************************************
000200160929     A* Fichier du personnel                                *
000300160929     A*                                                     *
000400160929     A*******************************************************
000500160929     A                                      UNIQUE
000600160929     A          R FICF                      PFILE(FIC00P)
000700160929     A                                      FORMAT(FIC00P)
000800160929     A          K FIMAT
