     A*******************************************************
     A* Fichier fonction                                    *
     A*                                                     *
     A*******************************************************
     A                                      UNIQUE
     A          R FIFF                      PFILE(FIF00P)
     A                                      FORMAT(FIF00P)
     A          K MIFON
