     A*******************************************************
     A* Fichier matricule                                   *
     A*                                                     *
     A*******************************************************
     A                                      UNIQUE
     A          R FIMF                      PFILE(FIM00P)
     A                                      FORMAT(FIM00P)
     A          K MIMAT
