     A*******************************************************
     A* Idx FON+NOM+PR1+PR2                                 *
     A*                                                     *
     A*******************************************************
     A          R FICF                      PFILE(FIC00P)
     A                                      FORMAT(FIC00P)
     A          K FIFON
     A          K FINOM
     A          K FIPR1
     A          K FIPR2
