000100180502     A*******************************************************
000200180502     A* Fichier fonction                                    *
000300180502     A*                                                     *
000400180502     A*******************************************************
000500180502     A                                      UNIQUE
000600180502     A          R FIFF                      PFILE(FIF00P)
000700180502     A                                      FORMAT(FIF00P)
000800180502     A          K MIFON
