0001.00            PGM        PARM(&SBS &MSG)
0002.00      /*DECLARATION VARIABLES                                    */
0003.00            DCL        VAR(&MSG) TYPE(*CHAR) LEN(500)
0004.00            DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
0005.00            DCL        VAR(&TYPE) TYPE(*CHAR) LEN(3)
0006.00            DCL        VAR(&SBS) TYPE(*CHAR) LEN(10)
0007.00      /*DECLARATION FICHIER                                      */
0008.00            DCLF       FILE(QTEMP/ACTJ)
0009.00      /*CREATION D’UN FICHIER DE TRAVAIL TEMPORAIRE              */
0010.00            DLTF QTEMP/ACTJ
0011.00            MONMSG CPF0000
0012.00            CRTPF      FILE(QTEMP/ACTJ) RCDLEN(130)
0013.00            MONMSG CPF0000
0014.00      /*PRINT DE L’ETAT D’UN SOUS SYSTEME                        */
0015.00            WRKACTJOB  OUTPUT(*PRINT) SBS(&SBS)
0016.00     /*COPIE DU SPOULE DANS LE FICHIER DE TRAVAIL               */
0017.00            CPYSPLF    FILE(QPDSPAJB) TOFILE(QTEMP/ACTJ) SPLNBR(*LAST)
0018.00     /*SUPPRESSION DU SPOULE                                    */
0019.00            DLTSPLF    FILE(QPDSPAJB) SPLNBR(*LAST)
0020.00  /*SUBSTITUTION ET LECTURE A PARTIR DE 11                   */
0021.00            OVRDBF     FILE(ACTJ) POSITION(*RRN 11)
0022.00  LECT:     RCVF       RCDFMT(ACTJ)
0023.00  /*MESSAGE DE FIN DE FICHIER                                */
0024.00            MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(FIN))
0025.00  /*RECHERCHE DE LA VALEUR A TRAITER                          */
0026.00            CHGVAR     VAR(&TYPE) VALUE(%SST(&ACTJ 38 3))
0027.00            IF         COND(&TYPE *NE �INT’) THEN(GOTO CMDLBL(LECT))
0028.00            ELSE       CMD(DO)
0029.00  /*SI ON A TROUVE ON ENVOIE UN MESSAGE                      */
0030.00            CHGVAR     VAR(&JOB) VALUE(%SST(&ACTJ 4 10))
0031.00            SNDBRKMSG  MSG(&MSG) TOMSGQ(&JOB)
0032.00            GOTO LECT
0033.00            ENDDO
0034.00
0035.00 FIN:       ENDPGM
