0001.00 /*******************************************************************/
0002.00 /* APPEL MENU                                                      */
0003.00 /*******************************************************************/
0004.00              GO         MENU(PGMUUT)
0005.00  FIN:        ENDPGM
        ***************  Fin des données  ************************************
