      * Prototype for Trans_Inc
     D  Trans_Inc      PR            11P 2
     D    Prod                       10P 0    VALUE
     D    Quantity                    5P 0    VALUE
     D    Discount                    2P 2    VALUE

      * Prototype for Prod_Name
     D  Prod_Name      PR            40A
     D    Prod                       10P 0    VALUE
