000100180502      * Prototype for Trans_Inc
000200180502     D  Trans_Inc      PR            11P 2
000300180502     D    Prod                       10P 0    VALUE
000400180502     D    Quantity                    5P 0    VALUE
000500180502     D    Discount                    2P 2    VALUE
000600180502
000700180502      * Prototype for Prod_Name
000800180502     D  Prod_Name      PR            40A
000900180502     D    Prod                       10P 0    VALUE
